// -----// IR Dump After CanonicalizeModule (canonicalize-module) //----- //
#map = affine_map<(d0) -> (d0)>
module {
  func.func @triton_argmax_1d_bool(%arg0: memref<?xi8>, %arg1: memref<?xi8>, %arg2: memref<?xi8> {tt.divisibility = 16 : i32, tt.tensor_kind = 0 : i32}, %arg3: memref<?xi32> {tt.divisibility = 16 : i32, tt.tensor_kind = 1 : i32}, %arg4: i32 {tt.divisibility = 16 : i32}, %arg5: i32, %arg6: i32, %arg7: i32, %arg8: i32, %arg9: i32, %arg10: i32) attributes {SyncBlockLockArgIdx = 0 : i64, WorkspaceArgIdx = 1 : i64, global_kernel = "local", mix_mode = "aiv", parallel_mode = "simd"} {
    %c0 = arith.constant 0 : index
    %c-1_i32 = arith.constant -1 : i32
    %false = arith.constant false
    %c0_i8 = arith.constant 0 : i8
    %0 = tensor.empty() : tensor<256xi8>
    %1 = linalg.fill ins(%c0_i8 : i8) outs(%0 : tensor<256xi8>) -> tensor<256xi8>
    %2 = tensor.empty() : tensor<256xi32>
    %3 = linalg.generic {indexing_maps = [#map], iterator_types = ["parallel"]} outs(%2 : tensor<256xi32>) {
    ^bb0(%out: i32):
      %12 = linalg.index 0 : index
      %13 = arith.index_cast %12 : index to i32
      linalg.yield %13 : i32
    } -> tensor<256xi32>
    %4 = arith.index_cast %arg8 : i32 to index
    %reinterpret_cast = memref.reinterpret_cast %arg2 to offset: [%4], sizes: [256], strides: [1] : memref<?xi8> to memref<256xi8, strided<[1], offset: ?>>
    %alloc = memref.alloc() : memref<256xi8>
    memref.copy %reinterpret_cast, %alloc : memref<256xi8, strided<[1], offset: ?>> to memref<256xi8>
    %5 = bufferization.to_tensor %alloc restrict writable : memref<256xi8>
    %6 = arith.cmpi ne, %5, %1 : tensor<256xi8>
    %7 = tensor.empty() : tensor<i1>
    %8 = linalg.fill ins(%false : i1) outs(%7 : tensor<i1>) -> tensor<i1>
    %9 = tensor.empty() : tensor<i32>
    %10 = linalg.fill ins(%c-1_i32 : i32) outs(%9 : tensor<i32>) -> tensor<i32>
    %reduced:2 = linalg.reduce ins(%6, %3 : tensor<256xi1>, tensor<256xi32>) outs(%8, %10 : tensor<i1>, tensor<i32>) dimensions = [0] 
      (%in: i1, %in_1: i32, %init: i1, %init_2: i32) {
        %12 = arith.cmpi ugt, %in, %init : i1
        %13 = arith.cmpi eq, %in, %init : i1
        %14 = arith.cmpi slt, %in_1, %init_2 : i32
        %15 = arith.andi %13, %14 : i1
        %16 = arith.ori %12, %15 : i1
        %17 = arith.select %16, %in, %init : i1
        %18 = arith.select %16, %in_1, %init_2 : i32
        linalg.yield %17, %18 : i1, i32
      }
    %extracted = tensor.extract %reduced#1[] : tensor<i32>
    %11 = tensor.empty() : tensor<1xi32>
    %inserted = tensor.insert %extracted into %11[%c0] : tensor<1xi32>
    %reinterpret_cast_0 = memref.reinterpret_cast %arg3 to offset: [0], sizes: [1], strides: [1] : memref<?xi32> to memref<1xi32, strided<[1]>>
    bufferization.materialize_in_destination %inserted in writable %reinterpret_cast_0 : (tensor<1xi32>, memref<1xi32, strided<[1]>>) -> ()
    return
  }
}


// -----// IR Dump After AppendTargetDeviceSpec (hacc-append-device-spec) //----- //
#map = affine_map<(d0) -> (d0)>
module attributes {dlti.target_system_spec = #dlti.target_system_spec<"NPU" : #hacc.target_device_spec<#dlti.dl_entry<"AI_CORE_COUNT", 24 : i32>, #dlti.dl_entry<"CUBE_CORE_COUNT", 24 : i32>, #dlti.dl_entry<"VECTOR_CORE_COUNT", 48 : i32>, #dlti.dl_entry<"UB_SIZE", 1572864 : i32>, #dlti.dl_entry<"L1_SIZE", 4194304 : i32>, #dlti.dl_entry<"L0A_SIZE", 524288 : i32>, #dlti.dl_entry<"L0B_SIZE", 524288 : i32>, #dlti.dl_entry<"L0C_SIZE", 1048576 : i32>, #dlti.dl_entry<"UB_ALIGN_SIZE", 256 : i32>, #dlti.dl_entry<"L1_ALIGN_SIZE", 256 : i32>, #dlti.dl_entry<"L0C_ALIGN_SIZE", 4096 : i32>>>} {
  func.func @triton_argmax_1d_bool(%arg0: memref<?xi8>, %arg1: memref<?xi8>, %arg2: memref<?xi8> {tt.divisibility = 16 : i32, tt.tensor_kind = 0 : i32}, %arg3: memref<?xi32> {tt.divisibility = 16 : i32, tt.tensor_kind = 1 : i32}, %arg4: i32 {tt.divisibility = 16 : i32}, %arg5: i32, %arg6: i32, %arg7: i32, %arg8: i32, %arg9: i32, %arg10: i32) attributes {SyncBlockLockArgIdx = 0 : i64, WorkspaceArgIdx = 1 : i64, global_kernel = "local", mix_mode = "aiv", parallel_mode = "simd"} {
    %c0 = arith.constant 0 : index
    %c-1_i32 = arith.constant -1 : i32
    %false = arith.constant false
    %c0_i8 = arith.constant 0 : i8
    %0 = tensor.empty() : tensor<256xi8>
    %1 = linalg.fill ins(%c0_i8 : i8) outs(%0 : tensor<256xi8>) -> tensor<256xi8>
    %2 = tensor.empty() : tensor<256xi32>
    %3 = linalg.generic {indexing_maps = [#map], iterator_types = ["parallel"]} outs(%2 : tensor<256xi32>) {
    ^bb0(%out: i32):
      %12 = linalg.index 0 : index
      %13 = arith.index_cast %12 : index to i32
      linalg.yield %13 : i32
    } -> tensor<256xi32>
    %4 = arith.index_cast %arg8 : i32 to index
    %reinterpret_cast = memref.reinterpret_cast %arg2 to offset: [%4], sizes: [256], strides: [1] : memref<?xi8> to memref<256xi8, strided<[1], offset: ?>>
    %alloc = memref.alloc() : memref<256xi8>
    memref.copy %reinterpret_cast, %alloc : memref<256xi8, strided<[1], offset: ?>> to memref<256xi8>
    %5 = bufferization.to_tensor %alloc restrict writable : memref<256xi8>
    %6 = arith.cmpi ne, %5, %1 : tensor<256xi8>
    %7 = tensor.empty() : tensor<i1>
    %8 = linalg.fill ins(%false : i1) outs(%7 : tensor<i1>) -> tensor<i1>
    %9 = tensor.empty() : tensor<i32>
    %10 = linalg.fill ins(%c-1_i32 : i32) outs(%9 : tensor<i32>) -> tensor<i32>
    %reduced:2 = linalg.reduce ins(%6, %3 : tensor<256xi1>, tensor<256xi32>) outs(%8, %10 : tensor<i1>, tensor<i32>) dimensions = [0] 
      (%in: i1, %in_1: i32, %init: i1, %init_2: i32) {
        %12 = arith.cmpi ugt, %in, %init : i1
        %13 = arith.cmpi eq, %in, %init : i1
        %14 = arith.cmpi slt, %in_1, %init_2 : i32
        %15 = arith.andi %13, %14 : i1
        %16 = arith.ori %12, %15 : i1
        %17 = arith.select %16, %in, %init : i1
        %18 = arith.select %16, %in_1, %init_2 : i32
        linalg.yield %17, %18 : i1, i32
      }
    %extracted = tensor.extract %reduced#1[] : tensor<i32>
    %11 = tensor.empty() : tensor<1xi32>
    %inserted = tensor.insert %extracted into %11[%c0] : tensor<1xi32>
    %reinterpret_cast_0 = memref.reinterpret_cast %arg3 to offset: [0], sizes: [1], strides: [1] : memref<?xi32> to memref<1xi32, strided<[1]>>
    bufferization.materialize_in_destination %inserted in writable %reinterpret_cast_0 : (tensor<1xi32>, memref<1xi32, strided<[1]>>) -> ()
    return
  }
}


// -----// IR Dump After EraseSymbol (erase-symbol) //----- //
func.func @triton_argmax_1d_bool(%arg0: memref<?xi8>, %arg1: memref<?xi8>, %arg2: memref<?xi8> {tt.divisibility = 16 : i32, tt.tensor_kind = 0 : i32}, %arg3: memref<?xi32> {tt.divisibility = 16 : i32, tt.tensor_kind = 1 : i32}, %arg4: i32 {tt.divisibility = 16 : i32}, %arg5: i32, %arg6: i32, %arg7: i32, %arg8: i32, %arg9: i32, %arg10: i32) attributes {SyncBlockLockArgIdx = 0 : i64, WorkspaceArgIdx = 1 : i64, global_kernel = "local", mix_mode = "aiv", parallel_mode = "simd"} {
  %c0 = arith.constant 0 : index
  %c-1_i32 = arith.constant -1 : i32
  %false = arith.constant false
  %c0_i8 = arith.constant 0 : i8
  %0 = tensor.empty() : tensor<256xi8>
  %1 = linalg.fill ins(%c0_i8 : i8) outs(%0 : tensor<256xi8>) -> tensor<256xi8>
  %2 = tensor.empty() : tensor<256xi32>
  %3 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} outs(%2 : tensor<256xi32>) {
  ^bb0(%out: i32):
    %12 = linalg.index 0 : index
    %13 = arith.index_cast %12 : index to i32
    linalg.yield %13 : i32
  } -> tensor<256xi32>
  %4 = arith.index_cast %arg8 : i32 to index
  %reinterpret_cast = memref.reinterpret_cast %arg2 to offset: [%4], sizes: [256], strides: [1] : memref<?xi8> to memref<256xi8, strided<[1], offset: ?>>
  %alloc = memref.alloc() : memref<256xi8>
  memref.copy %reinterpret_cast, %alloc : memref<256xi8, strided<[1], offset: ?>> to memref<256xi8>
  %5 = bufferization.to_tensor %alloc restrict writable : memref<256xi8>
  %6 = arith.cmpi ne, %5, %1 : tensor<256xi8>
  %7 = tensor.empty() : tensor<i1>
  %8 = linalg.fill ins(%false : i1) outs(%7 : tensor<i1>) -> tensor<i1>
  %9 = tensor.empty() : tensor<i32>
  %10 = linalg.fill ins(%c-1_i32 : i32) outs(%9 : tensor<i32>) -> tensor<i32>
  %reduced:2 = linalg.reduce ins(%6, %3 : tensor<256xi1>, tensor<256xi32>) outs(%8, %10 : tensor<i1>, tensor<i32>) dimensions = [0] 
    (%in: i1, %in_1: i32, %init: i1, %init_2: i32) {
      %12 = arith.cmpi ugt, %in, %init : i1
      %13 = arith.cmpi eq, %in, %init : i1
      %14 = arith.cmpi slt, %in_1, %init_2 : i32
      %15 = arith.andi %13, %14 : i1
      %16 = arith.ori %12, %15 : i1
      %17 = arith.select %16, %in, %init : i1
      %18 = arith.select %16, %in_1, %init_2 : i32
      linalg.yield %17, %18 : i1, i32
    }
  %extracted = tensor.extract %reduced#1[] : tensor<i32>
  %11 = tensor.empty() : tensor<1xi32>
  %inserted = tensor.insert %extracted into %11[%c0] : tensor<1xi32>
  %reinterpret_cast_0 = memref.reinterpret_cast %arg3 to offset: [0], sizes: [1], strides: [1] : memref<?xi32> to memref<1xi32, strided<[1]>>
  bufferization.materialize_in_destination %inserted in writable %reinterpret_cast_0 : (tensor<1xi32>, memref<1xi32, strided<[1]>>) -> ()
  return
}

// -----// IR Dump After ConvertArithToHFusion (convert-arith-to-hfusion) //----- //
#map = affine_map<(d0) -> (d0)>
module attributes {dlti.target_system_spec = #dlti.target_system_spec<"NPU" : #hacc.target_device_spec<#dlti.dl_entry<"AI_CORE_COUNT", 24 : i32>, #dlti.dl_entry<"CUBE_CORE_COUNT", 24 : i32>, #dlti.dl_entry<"VECTOR_CORE_COUNT", 48 : i32>, #dlti.dl_entry<"UB_SIZE", 1572864 : i32>, #dlti.dl_entry<"L1_SIZE", 4194304 : i32>, #dlti.dl_entry<"L0A_SIZE", 524288 : i32>, #dlti.dl_entry<"L0B_SIZE", 524288 : i32>, #dlti.dl_entry<"L0C_SIZE", 1048576 : i32>, #dlti.dl_entry<"UB_ALIGN_SIZE", 256 : i32>, #dlti.dl_entry<"L1_ALIGN_SIZE", 256 : i32>, #dlti.dl_entry<"L0C_ALIGN_SIZE", 4096 : i32>>>} {
  func.func @triton_argmax_1d_bool(%arg0: memref<?xi8>, %arg1: memref<?xi8>, %arg2: memref<?xi8> {tt.divisibility = 16 : i32, tt.tensor_kind = 0 : i32}, %arg3: memref<?xi32> {tt.divisibility = 16 : i32, tt.tensor_kind = 1 : i32}, %arg4: i32 {tt.divisibility = 16 : i32}, %arg5: i32, %arg6: i32, %arg7: i32, %arg8: i32, %arg9: i32, %arg10: i32) attributes {SyncBlockLockArgIdx = 0 : i64, WorkspaceArgIdx = 1 : i64, global_kernel = "local", mix_mode = "aiv", parallel_mode = "simd"} {
    %c0 = arith.constant 0 : index
    %c-1_i32 = arith.constant -1 : i32
    %false = arith.constant false
    %c0_i8 = arith.constant 0 : i8
    %0 = tensor.empty() : tensor<256xi8>
    %1 = linalg.fill ins(%c0_i8 : i8) outs(%0 : tensor<256xi8>) -> tensor<256xi8>
    %2 = tensor.empty() : tensor<256xi32>
    %3 = linalg.generic {indexing_maps = [#map], iterator_types = ["parallel"]} outs(%2 : tensor<256xi32>) {
    ^bb0(%out: i32):
      %13 = linalg.index 0 : index
      %14 = arith.index_cast %13 : index to i32
      linalg.yield %14 : i32
    } -> tensor<256xi32>
    %4 = arith.index_cast %arg8 : i32 to index
    %reinterpret_cast = memref.reinterpret_cast %arg2 to offset: [%4], sizes: [256], strides: [1] : memref<?xi8> to memref<256xi8, strided<[1], offset: ?>>
    %alloc = memref.alloc() : memref<256xi8>
    memref.copy %reinterpret_cast, %alloc : memref<256xi8, strided<[1], offset: ?>> to memref<256xi8>
    %5 = bufferization.to_tensor %alloc restrict writable : memref<256xi8>
    %6 = tensor.empty() : tensor<256xi1>
    %7 = hfusion.compare {compare_fn = #hfusion.compare_fn<vne>} ins(%5, %1 : tensor<256xi8>, tensor<256xi8>) outs(%6 : tensor<256xi1>) -> tensor<256xi1>
    %8 = tensor.empty() : tensor<i1>
    %9 = linalg.fill ins(%false : i1) outs(%8 : tensor<i1>) -> tensor<i1>
    %10 = tensor.empty() : tensor<i32>
    %11 = linalg.fill ins(%c-1_i32 : i32) outs(%10 : tensor<i32>) -> tensor<i32>
    %reduced:2 = linalg.reduce ins(%7, %3 : tensor<256xi1>, tensor<256xi32>) outs(%9, %11 : tensor<i1>, tensor<i32>) dimensions = [0] 
      (%in: i1, %in_1: i32, %init: i1, %init_2: i32) {
        %13 = arith.cmpi ugt, %in, %init : i1
        %14 = arith.cmpi eq, %in, %init : i1
        %15 = arith.cmpi slt, %in_1, %init_2 : i32
        %16 = arith.andi %14, %15 : i1
        %17 = arith.ori %13, %16 : i1
        %18 = arith.select %17, %in, %init : i1
        %19 = arith.select %17, %in_1, %init_2 : i32
        linalg.yield %18, %19 : i1, i32
      }
    %extracted = tensor.extract %reduced#1[] : tensor<i32>
    %12 = tensor.empty() : tensor<1xi32>
    %inserted = tensor.insert %extracted into %12[%c0] : tensor<1xi32>
    %reinterpret_cast_0 = memref.reinterpret_cast %arg3 to offset: [0], sizes: [1], strides: [1] : memref<?xi32> to memref<1xi32, strided<[1]>>
    bufferization.materialize_in_destination %inserted in writable %reinterpret_cast_0 : (tensor<1xi32>, memref<1xi32, strided<[1]>>) -> ()
    return
  }
}


// -----// IR Dump After ConvertMathToHFusion (convert-math-to-hfusion) //----- //
#map = affine_map<(d0) -> (d0)>
module attributes {dlti.target_system_spec = #dlti.target_system_spec<"NPU" : #hacc.target_device_spec<#dlti.dl_entry<"AI_CORE_COUNT", 24 : i32>, #dlti.dl_entry<"CUBE_CORE_COUNT", 24 : i32>, #dlti.dl_entry<"VECTOR_CORE_COUNT", 48 : i32>, #dlti.dl_entry<"UB_SIZE", 1572864 : i32>, #dlti.dl_entry<"L1_SIZE", 4194304 : i32>, #dlti.dl_entry<"L0A_SIZE", 524288 : i32>, #dlti.dl_entry<"L0B_SIZE", 524288 : i32>, #dlti.dl_entry<"L0C_SIZE", 1048576 : i32>, #dlti.dl_entry<"UB_ALIGN_SIZE", 256 : i32>, #dlti.dl_entry<"L1_ALIGN_SIZE", 256 : i32>, #dlti.dl_entry<"L0C_ALIGN_SIZE", 4096 : i32>>>} {
  func.func @triton_argmax_1d_bool(%arg0: memref<?xi8>, %arg1: memref<?xi8>, %arg2: memref<?xi8> {tt.divisibility = 16 : i32, tt.tensor_kind = 0 : i32}, %arg3: memref<?xi32> {tt.divisibility = 16 : i32, tt.tensor_kind = 1 : i32}, %arg4: i32 {tt.divisibility = 16 : i32}, %arg5: i32, %arg6: i32, %arg7: i32, %arg8: i32, %arg9: i32, %arg10: i32) attributes {SyncBlockLockArgIdx = 0 : i64, WorkspaceArgIdx = 1 : i64, global_kernel = "local", mix_mode = "aiv", parallel_mode = "simd"} {
    %c0 = arith.constant 0 : index
    %c-1_i32 = arith.constant -1 : i32
    %false = arith.constant false
    %c0_i8 = arith.constant 0 : i8
    %0 = tensor.empty() : tensor<256xi8>
    %1 = linalg.fill ins(%c0_i8 : i8) outs(%0 : tensor<256xi8>) -> tensor<256xi8>
    %2 = tensor.empty() : tensor<256xi32>
    %3 = linalg.generic {indexing_maps = [#map], iterator_types = ["parallel"]} outs(%2 : tensor<256xi32>) {
    ^bb0(%out: i32):
      %13 = linalg.index 0 : index
      %14 = arith.index_cast %13 : index to i32
      linalg.yield %14 : i32
    } -> tensor<256xi32>
    %4 = arith.index_cast %arg8 : i32 to index
    %reinterpret_cast = memref.reinterpret_cast %arg2 to offset: [%4], sizes: [256], strides: [1] : memref<?xi8> to memref<256xi8, strided<[1], offset: ?>>
    %alloc = memref.alloc() : memref<256xi8>
    memref.copy %reinterpret_cast, %alloc : memref<256xi8, strided<[1], offset: ?>> to memref<256xi8>
    %5 = bufferization.to_tensor %alloc restrict writable : memref<256xi8>
    %6 = tensor.empty() : tensor<256xi1>
    %7 = hfusion.compare {compare_fn = #hfusion.compare_fn<vne>} ins(%5, %1 : tensor<256xi8>, tensor<256xi8>) outs(%6 : tensor<256xi1>) -> tensor<256xi1>
    %8 = tensor.empty() : tensor<i1>
    %9 = linalg.fill ins(%false : i1) outs(%8 : tensor<i1>) -> tensor<i1>
    %10 = tensor.empty() : tensor<i32>
    %11 = linalg.fill ins(%c-1_i32 : i32) outs(%10 : tensor<i32>) -> tensor<i32>
    %reduced:2 = linalg.reduce ins(%7, %3 : tensor<256xi1>, tensor<256xi32>) outs(%9, %11 : tensor<i1>, tensor<i32>) dimensions = [0] 
      (%in: i1, %in_1: i32, %init: i1, %init_2: i32) {
        %13 = arith.cmpi ugt, %in, %init : i1
        %14 = arith.cmpi eq, %in, %init : i1
        %15 = arith.cmpi slt, %in_1, %init_2 : i32
        %16 = arith.andi %14, %15 : i1
        %17 = arith.ori %13, %16 : i1
        %18 = arith.select %17, %in, %init : i1
        %19 = arith.select %17, %in_1, %init_2 : i32
        linalg.yield %18, %19 : i1, i32
      }
    %extracted = tensor.extract %reduced#1[] : tensor<i32>
    %12 = tensor.empty() : tensor<1xi32>
    %inserted = tensor.insert %extracted into %12[%c0] : tensor<1xi32>
    %reinterpret_cast_0 = memref.reinterpret_cast %arg3 to offset: [0], sizes: [1], strides: [1] : memref<?xi32> to memref<1xi32, strided<[1]>>
    bufferization.materialize_in_destination %inserted in writable %reinterpret_cast_0 : (tensor<1xi32>, memref<1xi32, strided<[1]>>) -> ()
    return
  }
}


// -----// IR Dump After ConvertLinalgToHFusion (convert-linalg-to-hfusion) //----- //
module attributes {dlti.target_system_spec = #dlti.target_system_spec<"NPU" : #hacc.target_device_spec<#dlti.dl_entry<"AI_CORE_COUNT", 24 : i32>, #dlti.dl_entry<"CUBE_CORE_COUNT", 24 : i32>, #dlti.dl_entry<"VECTOR_CORE_COUNT", 48 : i32>, #dlti.dl_entry<"UB_SIZE", 1572864 : i32>, #dlti.dl_entry<"L1_SIZE", 4194304 : i32>, #dlti.dl_entry<"L0A_SIZE", 524288 : i32>, #dlti.dl_entry<"L0B_SIZE", 524288 : i32>, #dlti.dl_entry<"L0C_SIZE", 1048576 : i32>, #dlti.dl_entry<"UB_ALIGN_SIZE", 256 : i32>, #dlti.dl_entry<"L1_ALIGN_SIZE", 256 : i32>, #dlti.dl_entry<"L0C_ALIGN_SIZE", 4096 : i32>>>} {
  func.func @triton_argmax_1d_bool(%arg0: memref<?xi8>, %arg1: memref<?xi8>, %arg2: memref<?xi8> {tt.divisibility = 16 : i32, tt.tensor_kind = 0 : i32}, %arg3: memref<?xi32> {tt.divisibility = 16 : i32, tt.tensor_kind = 1 : i32}, %arg4: i32 {tt.divisibility = 16 : i32}, %arg5: i32, %arg6: i32, %arg7: i32, %arg8: i32, %arg9: i32, %arg10: i32) attributes {SyncBlockLockArgIdx = 0 : i64, WorkspaceArgIdx = 1 : i64, global_kernel = "local", mix_mode = "aiv", parallel_mode = "simd"} {
    %c0 = arith.constant 0 : index
    %c-1_i32 = arith.constant -1 : i32
    %false = arith.constant false
    %c0_i8 = arith.constant 0 : i8
    %0 = tensor.empty() : tensor<256xi8>
    %1 = linalg.fill ins(%c0_i8 : i8) outs(%0 : tensor<256xi8>) -> tensor<256xi8>
    %2 = tensor.empty() : tensor<256xi32>
    %c1 = arith.constant 1 : index
    %c0_0 = arith.constant 0 : index
    %3 = hfusion.arange offset[%c0_0] strides[%c1] outs(%2 : tensor<256xi32>) -> tensor<256xi32>
    %4 = arith.index_cast %arg8 : i32 to index
    %reinterpret_cast = memref.reinterpret_cast %arg2 to offset: [%4], sizes: [256], strides: [1] : memref<?xi8> to memref<256xi8, strided<[1], offset: ?>>
    %alloc = memref.alloc() : memref<256xi8>
    memref.copy %reinterpret_cast, %alloc : memref<256xi8, strided<[1], offset: ?>> to memref<256xi8>
    %5 = bufferization.to_tensor %alloc restrict writable : memref<256xi8>
    %6 = tensor.empty() : tensor<256xi1>
    %7 = hfusion.compare {compare_fn = #hfusion.compare_fn<vne>} ins(%5, %1 : tensor<256xi8>, tensor<256xi8>) outs(%6 : tensor<256xi1>) -> tensor<256xi1>
    %8 = tensor.empty() : tensor<i1>
    %9 = linalg.fill ins(%false : i1) outs(%8 : tensor<i1>) -> tensor<i1>
    %10 = tensor.empty() : tensor<i32>
    %11 = linalg.fill ins(%c-1_i32 : i32) outs(%10 : tensor<i32>) -> tensor<i32>
    %reduced:2 = linalg.reduce ins(%7, %3 : tensor<256xi1>, tensor<256xi32>) outs(%9, %11 : tensor<i1>, tensor<i32>) dimensions = [0] 
      (%in: i1, %in_2: i32, %init: i1, %init_3: i32) {
        %13 = arith.cmpi ugt, %in, %init : i1
        %14 = arith.cmpi eq, %in, %init : i1
        %15 = arith.cmpi slt, %in_2, %init_3 : i32
        %16 = arith.andi %14, %15 : i1
        %17 = arith.ori %13, %16 : i1
        %18 = arith.select %17, %in, %init : i1
        %19 = arith.select %17, %in_2, %init_3 : i32
        linalg.yield %18, %19 : i1, i32
      }
    %extracted = tensor.extract %reduced#1[] : tensor<i32>
    %12 = tensor.empty() : tensor<1xi32>
    %inserted = tensor.insert %extracted into %12[%c0] : tensor<1xi32>
    %reinterpret_cast_1 = memref.reinterpret_cast %arg3 to offset: [0], sizes: [1], strides: [1] : memref<?xi32> to memref<1xi32, strided<[1]>>
    bufferization.materialize_in_destination %inserted in writable %reinterpret_cast_1 : (tensor<1xi32>, memref<1xi32, strided<[1]>>) -> ()
    return
  }
}


// -----// IR Dump After SymbolDCE (symbol-dce) //----- //
module attributes {dlti.target_system_spec = #dlti.target_system_spec<"NPU" : #hacc.target_device_spec<#dlti.dl_entry<"AI_CORE_COUNT", 24 : i32>, #dlti.dl_entry<"CUBE_CORE_COUNT", 24 : i32>, #dlti.dl_entry<"VECTOR_CORE_COUNT", 48 : i32>, #dlti.dl_entry<"UB_SIZE", 1572864 : i32>, #dlti.dl_entry<"L1_SIZE", 4194304 : i32>, #dlti.dl_entry<"L0A_SIZE", 524288 : i32>, #dlti.dl_entry<"L0B_SIZE", 524288 : i32>, #dlti.dl_entry<"L0C_SIZE", 1048576 : i32>, #dlti.dl_entry<"UB_ALIGN_SIZE", 256 : i32>, #dlti.dl_entry<"L1_ALIGN_SIZE", 256 : i32>, #dlti.dl_entry<"L0C_ALIGN_SIZE", 4096 : i32>>>} {
  func.func @triton_argmax_1d_bool(%arg0: memref<?xi8>, %arg1: memref<?xi8>, %arg2: memref<?xi8> {tt.divisibility = 16 : i32, tt.tensor_kind = 0 : i32}, %arg3: memref<?xi32> {tt.divisibility = 16 : i32, tt.tensor_kind = 1 : i32}, %arg4: i32 {tt.divisibility = 16 : i32}, %arg5: i32, %arg6: i32, %arg7: i32, %arg8: i32, %arg9: i32, %arg10: i32) attributes {SyncBlockLockArgIdx = 0 : i64, WorkspaceArgIdx = 1 : i64, global_kernel = "local", mix_mode = "aiv", parallel_mode = "simd"} {
    %c0 = arith.constant 0 : index
    %c-1_i32 = arith.constant -1 : i32
    %false = arith.constant false
    %c0_i8 = arith.constant 0 : i8
    %0 = tensor.empty() : tensor<256xi8>
    %1 = linalg.fill ins(%c0_i8 : i8) outs(%0 : tensor<256xi8>) -> tensor<256xi8>
    %2 = tensor.empty() : tensor<256xi32>
    %c1 = arith.constant 1 : index
    %c0_0 = arith.constant 0 : index
    %3 = hfusion.arange offset[%c0_0] strides[%c1] outs(%2 : tensor<256xi32>) -> tensor<256xi32>
    %4 = arith.index_cast %arg8 : i32 to index
    %reinterpret_cast = memref.reinterpret_cast %arg2 to offset: [%4], sizes: [256], strides: [1] : memref<?xi8> to memref<256xi8, strided<[1], offset: ?>>
    %alloc = memref.alloc() : memref<256xi8>
    memref.copy %reinterpret_cast, %alloc : memref<256xi8, strided<[1], offset: ?>> to memref<256xi8>
    %5 = bufferization.to_tensor %alloc restrict writable : memref<256xi8>
    %6 = tensor.empty() : tensor<256xi1>
    %7 = hfusion.compare {compare_fn = #hfusion.compare_fn<vne>} ins(%5, %1 : tensor<256xi8>, tensor<256xi8>) outs(%6 : tensor<256xi1>) -> tensor<256xi1>
    %8 = tensor.empty() : tensor<i1>
    %9 = linalg.fill ins(%false : i1) outs(%8 : tensor<i1>) -> tensor<i1>
    %10 = tensor.empty() : tensor<i32>
    %11 = linalg.fill ins(%c-1_i32 : i32) outs(%10 : tensor<i32>) -> tensor<i32>
    %reduced:2 = linalg.reduce ins(%7, %3 : tensor<256xi1>, tensor<256xi32>) outs(%9, %11 : tensor<i1>, tensor<i32>) dimensions = [0] 
      (%in: i1, %in_2: i32, %init: i1, %init_3: i32) {
        %13 = arith.cmpi ugt, %in, %init : i1
        %14 = arith.cmpi eq, %in, %init : i1
        %15 = arith.cmpi slt, %in_2, %init_3 : i32
        %16 = arith.andi %14, %15 : i1
        %17 = arith.ori %13, %16 : i1
        %18 = arith.select %17, %in, %init : i1
        %19 = arith.select %17, %in_2, %init_3 : i32
        linalg.yield %18, %19 : i1, i32
      }
    %extracted = tensor.extract %reduced#1[] : tensor<i32>
    %12 = tensor.empty() : tensor<1xi32>
    %inserted = tensor.insert %extracted into %12[%c0] : tensor<1xi32>
    %reinterpret_cast_1 = memref.reinterpret_cast %arg3 to offset: [0], sizes: [1], strides: [1] : memref<?xi32> to memref<1xi32, strided<[1]>>
    bufferization.materialize_in_destination %inserted in writable %reinterpret_cast_1 : (tensor<1xi32>, memref<1xi32, strided<[1]>>) -> ()
    return
  }
}


// -----// IR Dump After ConvertGPUToHFusion (convert-gpu-to-hfusion) //----- //
module attributes {dlti.target_system_spec = #dlti.target_system_spec<"NPU" : #hacc.target_device_spec<#dlti.dl_entry<"AI_CORE_COUNT", 24 : i32>, #dlti.dl_entry<"CUBE_CORE_COUNT", 24 : i32>, #dlti.dl_entry<"VECTOR_CORE_COUNT", 48 : i32>, #dlti.dl_entry<"UB_SIZE", 1572864 : i32>, #dlti.dl_entry<"L1_SIZE", 4194304 : i32>, #dlti.dl_entry<"L0A_SIZE", 524288 : i32>, #dlti.dl_entry<"L0B_SIZE", 524288 : i32>, #dlti.dl_entry<"L0C_SIZE", 1048576 : i32>, #dlti.dl_entry<"UB_ALIGN_SIZE", 256 : i32>, #dlti.dl_entry<"L1_ALIGN_SIZE", 256 : i32>, #dlti.dl_entry<"L0C_ALIGN_SIZE", 4096 : i32>>>} {
  func.func @triton_argmax_1d_bool(%arg0: memref<?xi8>, %arg1: memref<?xi8>, %arg2: memref<?xi8> {tt.divisibility = 16 : i32, tt.tensor_kind = 0 : i32}, %arg3: memref<?xi32> {tt.divisibility = 16 : i32, tt.tensor_kind = 1 : i32}, %arg4: i32 {tt.divisibility = 16 : i32}, %arg5: i32, %arg6: i32, %arg7: i32, %arg8: i32, %arg9: i32, %arg10: i32) attributes {SyncBlockLockArgIdx = 0 : i64, WorkspaceArgIdx = 1 : i64, global_kernel = "local", mix_mode = "aiv", parallel_mode = "simd"} {
    %c0 = arith.constant 0 : index
    %c-1_i32 = arith.constant -1 : i32
    %false = arith.constant false
    %c0_i8 = arith.constant 0 : i8
    %0 = tensor.empty() : tensor<256xi8>
    %1 = linalg.fill ins(%c0_i8 : i8) outs(%0 : tensor<256xi8>) -> tensor<256xi8>
    %2 = tensor.empty() : tensor<256xi32>
    %c1 = arith.constant 1 : index
    %c0_0 = arith.constant 0 : index
    %3 = hfusion.arange offset[%c0_0] strides[%c1] outs(%2 : tensor<256xi32>) -> tensor<256xi32>
    %4 = arith.index_cast %arg8 : i32 to index
    %reinterpret_cast = memref.reinterpret_cast %arg2 to offset: [%4], sizes: [256], strides: [1] : memref<?xi8> to memref<256xi8, strided<[1], offset: ?>>
    %alloc = memref.alloc() : memref<256xi8>
    memref.copy %reinterpret_cast, %alloc : memref<256xi8, strided<[1], offset: ?>> to memref<256xi8>
    %5 = bufferization.to_tensor %alloc restrict writable : memref<256xi8>
    %6 = tensor.empty() : tensor<256xi1>
    %7 = hfusion.compare {compare_fn = #hfusion.compare_fn<vne>} ins(%5, %1 : tensor<256xi8>, tensor<256xi8>) outs(%6 : tensor<256xi1>) -> tensor<256xi1>
    %8 = tensor.empty() : tensor<i1>
    %9 = linalg.fill ins(%false : i1) outs(%8 : tensor<i1>) -> tensor<i1>
    %10 = tensor.empty() : tensor<i32>
    %11 = linalg.fill ins(%c-1_i32 : i32) outs(%10 : tensor<i32>) -> tensor<i32>
    %reduced:2 = linalg.reduce ins(%7, %3 : tensor<256xi1>, tensor<256xi32>) outs(%9, %11 : tensor<i1>, tensor<i32>) dimensions = [0] 
      (%in: i1, %in_2: i32, %init: i1, %init_3: i32) {
        %13 = arith.cmpi ugt, %in, %init : i1
        %14 = arith.cmpi eq, %in, %init : i1
        %15 = arith.cmpi slt, %in_2, %init_3 : i32
        %16 = arith.andi %14, %15 : i1
        %17 = arith.ori %13, %16 : i1
        %18 = arith.select %17, %in, %init : i1
        %19 = arith.select %17, %in_2, %init_3 : i32
        linalg.yield %18, %19 : i1, i32
      }
    %extracted = tensor.extract %reduced#1[] : tensor<i32>
    %12 = tensor.empty() : tensor<1xi32>
    %inserted = tensor.insert %extracted into %12[%c0] : tensor<1xi32>
    %reinterpret_cast_1 = memref.reinterpret_cast %arg3 to offset: [0], sizes: [1], strides: [1] : memref<?xi32> to memref<1xi32, strided<[1]>>
    bufferization.materialize_in_destination %inserted in writable %reinterpret_cast_1 : (tensor<1xi32>, memref<1xi32, strided<[1]>>) -> ()
    return
  }
}


// -----// IR Dump After AdaptTritonKernel (adapt-triton-kernel) //----- //
module attributes {dlti.target_system_spec = #dlti.target_system_spec<"NPU" : #hacc.target_device_spec<#dlti.dl_entry<"AI_CORE_COUNT", 24 : i32>, #dlti.dl_entry<"CUBE_CORE_COUNT", 24 : i32>, #dlti.dl_entry<"VECTOR_CORE_COUNT", 48 : i32>, #dlti.dl_entry<"UB_SIZE", 1572864 : i32>, #dlti.dl_entry<"L1_SIZE", 4194304 : i32>, #dlti.dl_entry<"L0A_SIZE", 524288 : i32>, #dlti.dl_entry<"L0B_SIZE", 524288 : i32>, #dlti.dl_entry<"L0C_SIZE", 1048576 : i32>, #dlti.dl_entry<"UB_ALIGN_SIZE", 256 : i32>, #dlti.dl_entry<"L1_ALIGN_SIZE", 256 : i32>, #dlti.dl_entry<"L0C_ALIGN_SIZE", 4096 : i32>>>, hacc.triton_kernel} {
  func.func @triton_argmax_1d_bool(%arg0: memref<?xi8> {hacc.arg_type = #hacc.arg_type<sync_block_lock>}, %arg1: memref<?xi8> {hacc.arg_type = #hacc.arg_type<workspace>}, %arg2: memref<?xi8> {tt.divisibility = 16 : i32, tt.tensor_kind = 0 : i32}, %arg3: memref<?xi32> {tt.divisibility = 16 : i32, tt.tensor_kind = 1 : i32}, %arg4: i32 {tt.divisibility = 16 : i32}, %arg5: i32, %arg6: i32, %arg7: i32, %arg8: i32, %arg9: i32, %arg10: i32) attributes {SyncBlockLockArgIdx = 0 : i64, WorkspaceArgIdx = 1 : i64, hacc.entry, hacc.function_kind = #hacc.function_kind<DEVICE>, mix_mode = "aiv", parallel_mode = "simd"} {
    %c1 = arith.constant 1 : index
    %c0 = arith.constant 0 : index
    %c-1_i32 = arith.constant -1 : i32
    %false = arith.constant false
    %c0_i8 = arith.constant 0 : i8
    %0 = tensor.empty() : tensor<256xi8>
    %1 = linalg.fill ins(%c0_i8 : i8) outs(%0 : tensor<256xi8>) -> tensor<256xi8>
    %2 = tensor.empty() : tensor<256xi32>
    %3 = hfusion.arange offset[%c0] strides[%c1] outs(%2 : tensor<256xi32>) -> tensor<256xi32>
    %4 = arith.index_cast %arg8 : i32 to index
    %reinterpret_cast = memref.reinterpret_cast %arg2 to offset: [%4], sizes: [256], strides: [1] : memref<?xi8> to memref<256xi8, strided<[1], offset: ?>>
    %alloc = memref.alloc() : memref<256xi8>
    memref.copy %reinterpret_cast, %alloc : memref<256xi8, strided<[1], offset: ?>> to memref<256xi8>
    %5 = bufferization.to_tensor %alloc restrict writable : memref<256xi8>
    %6 = tensor.empty() : tensor<256xi1>
    %7 = hfusion.compare {compare_fn = #hfusion.compare_fn<vne>} ins(%5, %1 : tensor<256xi8>, tensor<256xi8>) outs(%6 : tensor<256xi1>) -> tensor<256xi1>
    %8 = tensor.empty() : tensor<i1>
    %9 = linalg.fill ins(%false : i1) outs(%8 : tensor<i1>) -> tensor<i1>
    %10 = tensor.empty() : tensor<i32>
    %11 = linalg.fill ins(%c-1_i32 : i32) outs(%10 : tensor<i32>) -> tensor<i32>
    %reduced:2 = linalg.reduce ins(%7, %3 : tensor<256xi1>, tensor<256xi32>) outs(%9, %11 : tensor<i1>, tensor<i32>) dimensions = [0] 
      (%in: i1, %in_1: i32, %init: i1, %init_2: i32) {
        %13 = arith.cmpi ugt, %in, %init : i1
        %14 = arith.cmpi eq, %in, %init : i1
        %15 = arith.cmpi slt, %in_1, %init_2 : i32
        %16 = arith.andi %14, %15 : i1
        %17 = arith.ori %13, %16 : i1
        %18 = arith.select %17, %in, %init : i1
        %19 = arith.select %17, %in_1, %init_2 : i32
        linalg.yield %18, %19 : i1, i32
      }
    %extracted = tensor.extract %reduced#1[] : tensor<i32>
    %12 = tensor.empty() : tensor<1xi32>
    %inserted = tensor.insert %extracted into %12[%c0] : tensor<1xi32>
    %reinterpret_cast_0 = memref.reinterpret_cast %arg3 to offset: [0], sizes: [1], strides: [1] : memref<?xi32> to memref<1xi32, strided<[1]>>
    bufferization.materialize_in_destination %inserted in writable %reinterpret_cast_0 : (tensor<1xi32>, memref<1xi32, strided<[1]>>) -> ()
    return
  }
}


// -----// IR Dump After ConvertTensorToHFusion (convert-tensor-to-hfusion) //----- //
module attributes {dlti.target_system_spec = #dlti.target_system_spec<"NPU" : #hacc.target_device_spec<#dlti.dl_entry<"AI_CORE_COUNT", 24 : i32>, #dlti.dl_entry<"CUBE_CORE_COUNT", 24 : i32>, #dlti.dl_entry<"VECTOR_CORE_COUNT", 48 : i32>, #dlti.dl_entry<"UB_SIZE", 1572864 : i32>, #dlti.dl_entry<"L1_SIZE", 4194304 : i32>, #dlti.dl_entry<"L0A_SIZE", 524288 : i32>, #dlti.dl_entry<"L0B_SIZE", 524288 : i32>, #dlti.dl_entry<"L0C_SIZE", 1048576 : i32>, #dlti.dl_entry<"UB_ALIGN_SIZE", 256 : i32>, #dlti.dl_entry<"L1_ALIGN_SIZE", 256 : i32>, #dlti.dl_entry<"L0C_ALIGN_SIZE", 4096 : i32>>>, hacc.triton_kernel} {
  func.func @triton_argmax_1d_bool(%arg0: memref<?xi8> {hacc.arg_type = #hacc.arg_type<sync_block_lock>}, %arg1: memref<?xi8> {hacc.arg_type = #hacc.arg_type<workspace>}, %arg2: memref<?xi8> {tt.divisibility = 16 : i32, tt.tensor_kind = 0 : i32}, %arg3: memref<?xi32> {tt.divisibility = 16 : i32, tt.tensor_kind = 1 : i32}, %arg4: i32 {tt.divisibility = 16 : i32}, %arg5: i32, %arg6: i32, %arg7: i32, %arg8: i32, %arg9: i32, %arg10: i32) attributes {SyncBlockLockArgIdx = 0 : i64, WorkspaceArgIdx = 1 : i64, hacc.entry, hacc.function_kind = #hacc.function_kind<DEVICE>, mix_mode = "aiv", parallel_mode = "simd"} {
    %c1 = arith.constant 1 : index
    %c0 = arith.constant 0 : index
    %c-1_i32 = arith.constant -1 : i32
    %false = arith.constant false
    %c0_i8 = arith.constant 0 : i8
    %0 = tensor.empty() : tensor<256xi8>
    %1 = linalg.fill ins(%c0_i8 : i8) outs(%0 : tensor<256xi8>) -> tensor<256xi8>
    %2 = tensor.empty() : tensor<256xi32>
    %3 = hfusion.arange offset[%c0] strides[%c1] outs(%2 : tensor<256xi32>) -> tensor<256xi32>
    %4 = arith.index_cast %arg8 : i32 to index
    %reinterpret_cast = memref.reinterpret_cast %arg2 to offset: [%4], sizes: [256], strides: [1] : memref<?xi8> to memref<256xi8, strided<[1], offset: ?>>
    %alloc = memref.alloc() : memref<256xi8>
    memref.copy %reinterpret_cast, %alloc : memref<256xi8, strided<[1], offset: ?>> to memref<256xi8>
    %5 = bufferization.to_tensor %alloc restrict writable : memref<256xi8>
    %6 = tensor.empty() : tensor<256xi1>
    %7 = hfusion.compare {compare_fn = #hfusion.compare_fn<vne>} ins(%5, %1 : tensor<256xi8>, tensor<256xi8>) outs(%6 : tensor<256xi1>) -> tensor<256xi1>
    %8 = tensor.empty() : tensor<i1>
    %9 = linalg.fill ins(%false : i1) outs(%8 : tensor<i1>) -> tensor<i1>
    %10 = tensor.empty() : tensor<i32>
    %11 = linalg.fill ins(%c-1_i32 : i32) outs(%10 : tensor<i32>) -> tensor<i32>
    %reduced:2 = linalg.reduce ins(%7, %3 : tensor<256xi1>, tensor<256xi32>) outs(%9, %11 : tensor<i1>, tensor<i32>) dimensions = [0] 
      (%in: i1, %in_1: i32, %init: i1, %init_2: i32) {
        %13 = arith.cmpi ugt, %in, %init : i1
        %14 = arith.cmpi eq, %in, %init : i1
        %15 = arith.cmpi slt, %in_1, %init_2 : i32
        %16 = arith.andi %14, %15 : i1
        %17 = arith.ori %13, %16 : i1
        %18 = arith.select %17, %in, %init : i1
        %19 = arith.select %17, %in_1, %init_2 : i32
        linalg.yield %18, %19 : i1, i32
      }
    %extracted = tensor.extract %reduced#1[] : tensor<i32>
    %12 = tensor.empty() : tensor<1xi32>
    %inserted = tensor.insert %extracted into %12[%c0] : tensor<1xi32>
    %reinterpret_cast_0 = memref.reinterpret_cast %arg3 to offset: [0], sizes: [1], strides: [1] : memref<?xi32> to memref<1xi32, strided<[1]>>
    bufferization.materialize_in_destination %inserted in writable %reinterpret_cast_0 : (tensor<1xi32>, memref<1xi32, strided<[1]>>) -> ()
    return
  }
}


// -----// IR Dump After CanonicalizeTensorReshape (canonicalize-tensor-reshape) //----- //
func.func @triton_argmax_1d_bool(%arg0: memref<?xi8> {hacc.arg_type = #hacc.arg_type<sync_block_lock>}, %arg1: memref<?xi8> {hacc.arg_type = #hacc.arg_type<workspace>}, %arg2: memref<?xi8> {tt.divisibility = 16 : i32, tt.tensor_kind = 0 : i32}, %arg3: memref<?xi32> {tt.divisibility = 16 : i32, tt.tensor_kind = 1 : i32}, %arg4: i32 {tt.divisibility = 16 : i32}, %arg5: i32, %arg6: i32, %arg7: i32, %arg8: i32, %arg9: i32, %arg10: i32) attributes {SyncBlockLockArgIdx = 0 : i64, WorkspaceArgIdx = 1 : i64, hacc.entry, hacc.function_kind = #hacc.function_kind<DEVICE>, mix_mode = "aiv", parallel_mode = "simd"} {
  %c1 = arith.constant 1 : index
  %c0 = arith.constant 0 : index
  %c-1_i32 = arith.constant -1 : i32
  %false = arith.constant false
  %c0_i8 = arith.constant 0 : i8
  %0 = tensor.empty() : tensor<256xi8>
  %1 = linalg.fill ins(%c0_i8 : i8) outs(%0 : tensor<256xi8>) -> tensor<256xi8>
  %2 = tensor.empty() : tensor<256xi32>
  %3 = hfusion.arange offset[%c0] strides[%c1] outs(%2 : tensor<256xi32>) -> tensor<256xi32>
  %4 = arith.index_cast %arg8 : i32 to index
  %reinterpret_cast = memref.reinterpret_cast %arg2 to offset: [%4], sizes: [256], strides: [1] : memref<?xi8> to memref<256xi8, strided<[1], offset: ?>>
  %alloc = memref.alloc() : memref<256xi8>
  memref.copy %reinterpret_cast, %alloc : memref<256xi8, strided<[1], offset: ?>> to memref<256xi8>
  %5 = bufferization.to_tensor %alloc restrict writable : memref<256xi8>
  %6 = tensor.empty() : tensor<256xi1>
  %7 = hfusion.compare {compare_fn = #hfusion.compare_fn<vne>} ins(%5, %1 : tensor<256xi8>, tensor<256xi8>) outs(%6 : tensor<256xi1>) -> tensor<256xi1>
  %8 = tensor.empty() : tensor<i1>
  %9 = linalg.fill ins(%false : i1) outs(%8 : tensor<i1>) -> tensor<i1>
  %10 = tensor.empty() : tensor<i32>
  %11 = linalg.fill ins(%c-1_i32 : i32) outs(%10 : tensor<i32>) -> tensor<i32>
  %reduced:2 = linalg.reduce ins(%7, %3 : tensor<256xi1>, tensor<256xi32>) outs(%9, %11 : tensor<i1>, tensor<i32>) dimensions = [0] 
    (%in: i1, %in_1: i32, %init: i1, %init_2: i32) {
      %13 = arith.cmpi ugt, %in, %init : i1
      %14 = arith.cmpi eq, %in, %init : i1
      %15 = arith.cmpi slt, %in_1, %init_2 : i32
      %16 = arith.andi %14, %15 : i1
      %17 = arith.ori %13, %16 : i1
      %18 = arith.select %17, %in, %init : i1
      %19 = arith.select %17, %in_1, %init_2 : i32
      linalg.yield %18, %19 : i1, i32
    }
  %extracted = tensor.extract %reduced#1[] : tensor<i32>
  %12 = tensor.empty() : tensor<1xi32>
  %inserted = tensor.insert %extracted into %12[%c0] : tensor<1xi32>
  %reinterpret_cast_0 = memref.reinterpret_cast %arg3 to offset: [0], sizes: [1], strides: [1] : memref<?xi32> to memref<1xi32, strided<[1]>>
  bufferization.materialize_in_destination %inserted in writable %reinterpret_cast_0 : (tensor<1xi32>, memref<1xi32, strided<[1]>>) -> ()
  return
}

// -----// IR Dump After CSE (cse) //----- //
module attributes {dlti.target_system_spec = #dlti.target_system_spec<"NPU" : #hacc.target_device_spec<#dlti.dl_entry<"AI_CORE_COUNT", 24 : i32>, #dlti.dl_entry<"CUBE_CORE_COUNT", 24 : i32>, #dlti.dl_entry<"VECTOR_CORE_COUNT", 48 : i32>, #dlti.dl_entry<"UB_SIZE", 1572864 : i32>, #dlti.dl_entry<"L1_SIZE", 4194304 : i32>, #dlti.dl_entry<"L0A_SIZE", 524288 : i32>, #dlti.dl_entry<"L0B_SIZE", 524288 : i32>, #dlti.dl_entry<"L0C_SIZE", 1048576 : i32>, #dlti.dl_entry<"UB_ALIGN_SIZE", 256 : i32>, #dlti.dl_entry<"L1_ALIGN_SIZE", 256 : i32>, #dlti.dl_entry<"L0C_ALIGN_SIZE", 4096 : i32>>>, hacc.triton_kernel} {
  func.func @triton_argmax_1d_bool(%arg0: memref<?xi8> {hacc.arg_type = #hacc.arg_type<sync_block_lock>}, %arg1: memref<?xi8> {hacc.arg_type = #hacc.arg_type<workspace>}, %arg2: memref<?xi8> {tt.divisibility = 16 : i32, tt.tensor_kind = 0 : i32}, %arg3: memref<?xi32> {tt.divisibility = 16 : i32, tt.tensor_kind = 1 : i32}, %arg4: i32 {tt.divisibility = 16 : i32}, %arg5: i32, %arg6: i32, %arg7: i32, %arg8: i32, %arg9: i32, %arg10: i32) attributes {SyncBlockLockArgIdx = 0 : i64, WorkspaceArgIdx = 1 : i64, hacc.entry, hacc.function_kind = #hacc.function_kind<DEVICE>, mix_mode = "aiv", parallel_mode = "simd"} {
    %c1 = arith.constant 1 : index
    %c0 = arith.constant 0 : index
    %c-1_i32 = arith.constant -1 : i32
    %false = arith.constant false
    %c0_i8 = arith.constant 0 : i8
    %0 = tensor.empty() : tensor<256xi8>
    %1 = linalg.fill ins(%c0_i8 : i8) outs(%0 : tensor<256xi8>) -> tensor<256xi8>
    %2 = tensor.empty() : tensor<256xi32>
    %3 = hfusion.arange offset[%c0] strides[%c1] outs(%2 : tensor<256xi32>) -> tensor<256xi32>
    %4 = arith.index_cast %arg8 : i32 to index
    %reinterpret_cast = memref.reinterpret_cast %arg2 to offset: [%4], sizes: [256], strides: [1] : memref<?xi8> to memref<256xi8, strided<[1], offset: ?>>
    %alloc = memref.alloc() : memref<256xi8>
    memref.copy %reinterpret_cast, %alloc : memref<256xi8, strided<[1], offset: ?>> to memref<256xi8>
    %5 = bufferization.to_tensor %alloc restrict writable : memref<256xi8>
    %6 = tensor.empty() : tensor<256xi1>
    %7 = hfusion.compare {compare_fn = #hfusion.compare_fn<vne>} ins(%5, %1 : tensor<256xi8>, tensor<256xi8>) outs(%6 : tensor<256xi1>) -> tensor<256xi1>
    %8 = tensor.empty() : tensor<i1>
    %9 = linalg.fill ins(%false : i1) outs(%8 : tensor<i1>) -> tensor<i1>
    %10 = tensor.empty() : tensor<i32>
    %11 = linalg.fill ins(%c-1_i32 : i32) outs(%10 : tensor<i32>) -> tensor<i32>
    %reduced:2 = linalg.reduce ins(%7, %3 : tensor<256xi1>, tensor<256xi32>) outs(%9, %11 : tensor<i1>, tensor<i32>) dimensions = [0] 
      (%in: i1, %in_1: i32, %init: i1, %init_2: i32) {
        %13 = arith.cmpi ugt, %in, %init : i1
        %14 = arith.cmpi eq, %in, %init : i1
        %15 = arith.cmpi slt, %in_1, %init_2 : i32
        %16 = arith.andi %14, %15 : i1
        %17 = arith.ori %13, %16 : i1
        %18 = arith.select %17, %in, %init : i1
        %19 = arith.select %17, %in_1, %init_2 : i32
        linalg.yield %18, %19 : i1, i32
      }
    %extracted = tensor.extract %reduced#1[] : tensor<i32>
    %12 = tensor.empty() : tensor<1xi32>
    %inserted = tensor.insert %extracted into %12[%c0] : tensor<1xi32>
    %reinterpret_cast_0 = memref.reinterpret_cast %arg3 to offset: [0], sizes: [1], strides: [1] : memref<?xi32> to memref<1xi32, strided<[1]>>
    bufferization.materialize_in_destination %inserted in writable %reinterpret_cast_0 : (tensor<1xi32>, memref<1xi32, strided<[1]>>) -> ()
    return
  }
}


// -----// IR Dump After ExtendedCanonicalizer (canonicalize-ext) //----- //
module attributes {dlti.target_system_spec = #dlti.target_system_spec<"NPU" : #hacc.target_device_spec<#dlti.dl_entry<"AI_CORE_COUNT", 24 : i32>, #dlti.dl_entry<"CUBE_CORE_COUNT", 24 : i32>, #dlti.dl_entry<"VECTOR_CORE_COUNT", 48 : i32>, #dlti.dl_entry<"UB_SIZE", 1572864 : i32>, #dlti.dl_entry<"L1_SIZE", 4194304 : i32>, #dlti.dl_entry<"L0A_SIZE", 524288 : i32>, #dlti.dl_entry<"L0B_SIZE", 524288 : i32>, #dlti.dl_entry<"L0C_SIZE", 1048576 : i32>, #dlti.dl_entry<"UB_ALIGN_SIZE", 256 : i32>, #dlti.dl_entry<"L1_ALIGN_SIZE", 256 : i32>, #dlti.dl_entry<"L0C_ALIGN_SIZE", 4096 : i32>>>, hacc.triton_kernel} {
  func.func @triton_argmax_1d_bool(%arg0: memref<?xi8> {hacc.arg_type = #hacc.arg_type<sync_block_lock>}, %arg1: memref<?xi8> {hacc.arg_type = #hacc.arg_type<workspace>}, %arg2: memref<?xi8> {tt.divisibility = 16 : i32, tt.tensor_kind = 0 : i32}, %arg3: memref<?xi32> {tt.divisibility = 16 : i32, tt.tensor_kind = 1 : i32}, %arg4: i32 {tt.divisibility = 16 : i32}, %arg5: i32, %arg6: i32, %arg7: i32, %arg8: i32, %arg9: i32, %arg10: i32) attributes {SyncBlockLockArgIdx = 0 : i64, WorkspaceArgIdx = 1 : i64, hacc.entry, hacc.function_kind = #hacc.function_kind<DEVICE>, mix_mode = "aiv", parallel_mode = "simd"} {
    %c1 = arith.constant 1 : index
    %c0 = arith.constant 0 : index
    %c-1_i32 = arith.constant -1 : i32
    %false = arith.constant false
    %c0_i8 = arith.constant 0 : i8
    %0 = tensor.empty() : tensor<256xi8>
    %1 = linalg.fill ins(%c0_i8 : i8) outs(%0 : tensor<256xi8>) -> tensor<256xi8>
    %2 = tensor.empty() : tensor<256xi32>
    %3 = hfusion.arange offset[%c0] strides[%c1] outs(%2 : tensor<256xi32>) -> tensor<256xi32>
    %4 = arith.index_cast %arg8 : i32 to index
    %reinterpret_cast = memref.reinterpret_cast %arg2 to offset: [%4], sizes: [256], strides: [1] : memref<?xi8> to memref<256xi8, strided<[1], offset: ?>>
    %alloc = memref.alloc() : memref<256xi8>
    memref.copy %reinterpret_cast, %alloc : memref<256xi8, strided<[1], offset: ?>> to memref<256xi8>
    %5 = bufferization.to_tensor %alloc restrict writable : memref<256xi8>
    %6 = tensor.empty() : tensor<256xi1>
    %7 = hfusion.compare {compare_fn = #hfusion.compare_fn<vne>} ins(%5, %1 : tensor<256xi8>, tensor<256xi8>) outs(%6 : tensor<256xi1>) -> tensor<256xi1>
    %8 = tensor.empty() : tensor<i1>
    %9 = linalg.fill ins(%false : i1) outs(%8 : tensor<i1>) -> tensor<i1>
    %10 = tensor.empty() : tensor<i32>
    %11 = linalg.fill ins(%c-1_i32 : i32) outs(%10 : tensor<i32>) -> tensor<i32>
    %reduced:2 = linalg.reduce ins(%7, %3 : tensor<256xi1>, tensor<256xi32>) outs(%9, %11 : tensor<i1>, tensor<i32>) dimensions = [0] 
      (%in: i1, %in_1: i32, %init: i1, %init_2: i32) {
        %13 = arith.cmpi ugt, %in, %init : i1
        %14 = arith.cmpi eq, %in, %init : i1
        %15 = arith.cmpi slt, %in_1, %init_2 : i32
        %16 = arith.andi %14, %15 : i1
        %17 = arith.ori %13, %16 : i1
        %18 = arith.select %17, %in, %init : i1
        %19 = arith.select %17, %in_1, %init_2 : i32
        linalg.yield %18, %19 : i1, i32
      }
    %extracted = tensor.extract %reduced#1[] : tensor<i32>
    %12 = tensor.empty() : tensor<1xi32>
    %inserted = tensor.insert %extracted into %12[%c0] : tensor<1xi32>
    %reinterpret_cast_0 = memref.reinterpret_cast %arg3 to offset: [0], sizes: [1], strides: [1] : memref<?xi32> to memref<1xi32, strided<[1]>>
    bufferization.materialize_in_destination %inserted in writable %reinterpret_cast_0 : (tensor<1xi32>, memref<1xi32, strided<[1]>>) -> ()
    return
  }
}


// -----// IR Dump After NormalizeTensorOps (normalize-tensor-ops) //----- //
func.func @triton_argmax_1d_bool(%arg0: memref<?xi8> {hacc.arg_type = #hacc.arg_type<sync_block_lock>}, %arg1: memref<?xi8> {hacc.arg_type = #hacc.arg_type<workspace>}, %arg2: memref<?xi8> {tt.divisibility = 16 : i32, tt.tensor_kind = 0 : i32}, %arg3: memref<?xi32> {tt.divisibility = 16 : i32, tt.tensor_kind = 1 : i32}, %arg4: i32 {tt.divisibility = 16 : i32}, %arg5: i32, %arg6: i32, %arg7: i32, %arg8: i32, %arg9: i32, %arg10: i32) attributes {SyncBlockLockArgIdx = 0 : i64, WorkspaceArgIdx = 1 : i64, hacc.entry, hacc.function_kind = #hacc.function_kind<DEVICE>, mix_mode = "aiv", parallel_mode = "simd"} {
  %c1 = arith.constant 1 : index
  %c0 = arith.constant 0 : index
  %c-1_i32 = arith.constant -1 : i32
  %false = arith.constant false
  %c0_i8 = arith.constant 0 : i8
  %0 = tensor.empty() : tensor<256xi8>
  %1 = linalg.fill ins(%c0_i8 : i8) outs(%0 : tensor<256xi8>) -> tensor<256xi8>
  %2 = tensor.empty() : tensor<256xi32>
  %3 = hfusion.arange offset[%c0] strides[%c1] outs(%2 : tensor<256xi32>) -> tensor<256xi32>
  %4 = arith.index_cast %arg8 : i32 to index
  %reinterpret_cast = memref.reinterpret_cast %arg2 to offset: [%4], sizes: [256], strides: [1] : memref<?xi8> to memref<256xi8, strided<[1], offset: ?>>
  %alloc = memref.alloc() : memref<256xi8>
  memref.copy %reinterpret_cast, %alloc : memref<256xi8, strided<[1], offset: ?>> to memref<256xi8>
  %5 = bufferization.to_tensor %alloc restrict writable : memref<256xi8>
  %6 = tensor.empty() : tensor<256xi1>
  %7 = hfusion.compare {compare_fn = #hfusion.compare_fn<vne>} ins(%5, %1 : tensor<256xi8>, tensor<256xi8>) outs(%6 : tensor<256xi1>) -> tensor<256xi1>
  %8 = tensor.empty() : tensor<i1>
  %9 = linalg.fill ins(%false : i1) outs(%8 : tensor<i1>) -> tensor<i1>
  %10 = tensor.empty() : tensor<i32>
  %11 = linalg.fill ins(%c-1_i32 : i32) outs(%10 : tensor<i32>) -> tensor<i32>
  %reduced:2 = linalg.reduce ins(%7, %3 : tensor<256xi1>, tensor<256xi32>) outs(%9, %11 : tensor<i1>, tensor<i32>) dimensions = [0] 
    (%in: i1, %in_1: i32, %init: i1, %init_2: i32) {
      %13 = arith.cmpi ugt, %in, %init : i1
      %14 = arith.cmpi eq, %in, %init : i1
      %15 = arith.cmpi slt, %in_1, %init_2 : i32
      %16 = arith.andi %14, %15 : i1
      %17 = arith.ori %13, %16 : i1
      %18 = arith.select %17, %in, %init : i1
      %19 = arith.select %17, %in_1, %init_2 : i32
      linalg.yield %18, %19 : i1, i32
    }
  %extracted = tensor.extract %reduced#1[] : tensor<i32>
  %12 = tensor.empty() : tensor<1xi32>
  %inserted = tensor.insert %extracted into %12[%c0] : tensor<1xi32>
  %reinterpret_cast_0 = memref.reinterpret_cast %arg3 to offset: [0], sizes: [1], strides: [1] : memref<?xi32> to memref<1xi32, strided<[1]>>
  bufferization.materialize_in_destination %inserted in writable %reinterpret_cast_0 : (tensor<1xi32>, memref<1xi32, strided<[1]>>) -> ()
  return
}

// -----// IR Dump After ConvertArithToHFusion (convert-arith-to-hfusion) //----- //
module attributes {dlti.target_system_spec = #dlti.target_system_spec<"NPU" : #hacc.target_device_spec<#dlti.dl_entry<"AI_CORE_COUNT", 24 : i32>, #dlti.dl_entry<"CUBE_CORE_COUNT", 24 : i32>, #dlti.dl_entry<"VECTOR_CORE_COUNT", 48 : i32>, #dlti.dl_entry<"UB_SIZE", 1572864 : i32>, #dlti.dl_entry<"L1_SIZE", 4194304 : i32>, #dlti.dl_entry<"L0A_SIZE", 524288 : i32>, #dlti.dl_entry<"L0B_SIZE", 524288 : i32>, #dlti.dl_entry<"L0C_SIZE", 1048576 : i32>, #dlti.dl_entry<"UB_ALIGN_SIZE", 256 : i32>, #dlti.dl_entry<"L1_ALIGN_SIZE", 256 : i32>, #dlti.dl_entry<"L0C_ALIGN_SIZE", 4096 : i32>>>, hacc.triton_kernel} {
  func.func @triton_argmax_1d_bool(%arg0: memref<?xi8> {hacc.arg_type = #hacc.arg_type<sync_block_lock>}, %arg1: memref<?xi8> {hacc.arg_type = #hacc.arg_type<workspace>}, %arg2: memref<?xi8> {tt.divisibility = 16 : i32, tt.tensor_kind = 0 : i32}, %arg3: memref<?xi32> {tt.divisibility = 16 : i32, tt.tensor_kind = 1 : i32}, %arg4: i32 {tt.divisibility = 16 : i32}, %arg5: i32, %arg6: i32, %arg7: i32, %arg8: i32, %arg9: i32, %arg10: i32) attributes {SyncBlockLockArgIdx = 0 : i64, WorkspaceArgIdx = 1 : i64, hacc.entry, hacc.function_kind = #hacc.function_kind<DEVICE>, mix_mode = "aiv", parallel_mode = "simd"} {
    %c1 = arith.constant 1 : index
    %c0 = arith.constant 0 : index
    %c-1_i32 = arith.constant -1 : i32
    %false = arith.constant false
    %c0_i8 = arith.constant 0 : i8
    %0 = tensor.empty() : tensor<256xi8>
    %1 = linalg.fill ins(%c0_i8 : i8) outs(%0 : tensor<256xi8>) -> tensor<256xi8>
    %2 = tensor.empty() : tensor<256xi32>
    %3 = hfusion.arange offset[%c0] strides[%c1] outs(%2 : tensor<256xi32>) -> tensor<256xi32>
    %4 = arith.index_cast %arg8 : i32 to index
    %reinterpret_cast = memref.reinterpret_cast %arg2 to offset: [%4], sizes: [256], strides: [1] : memref<?xi8> to memref<256xi8, strided<[1], offset: ?>>
    %alloc = memref.alloc() : memref<256xi8>
    memref.copy %reinterpret_cast, %alloc : memref<256xi8, strided<[1], offset: ?>> to memref<256xi8>
    %5 = bufferization.to_tensor %alloc restrict writable : memref<256xi8>
    %6 = tensor.empty() : tensor<256xi1>
    %7 = hfusion.compare {compare_fn = #hfusion.compare_fn<vne>} ins(%5, %1 : tensor<256xi8>, tensor<256xi8>) outs(%6 : tensor<256xi1>) -> tensor<256xi1>
    %8 = tensor.empty() : tensor<i1>
    %9 = linalg.fill ins(%false : i1) outs(%8 : tensor<i1>) -> tensor<i1>
    %10 = tensor.empty() : tensor<i32>
    %11 = linalg.fill ins(%c-1_i32 : i32) outs(%10 : tensor<i32>) -> tensor<i32>
